In [1]:
import pandas as pd
import numpy as np

# Set up test data frame
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B': [5,np.nan,np.nan],
                  'C': [1,2,3]})

# Dropping rows with NA column values
dropNARows = df.dropna()

# Dropping columns with NA row values
dropNAColumns = df.dropna(axis=1)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [2]:
# Drop rows with NA columns
df.dropna() # df.dropna(axis=0) is equivalent

     A    B  C
0  1.0  5.0  1

In [3]:
# Drop columns with NA rows
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [5]:
# Drop rows that do not have at least 2 non-NA values
df.dropna(axis=1, thresh=2)

     A  C
0  1.0  1
1  2.0  2
2  NaN  3

In [6]:
# Fill NA with specified values
df.fillna(value='NOT BLANK')

           A          B  C
0        1.0        5.0  1
1        2.0  NOT BLANK  2
2  NOT BLANK  NOT BLANK  3

In [8]:
# Fills all NA values of column A with the mean of all A values
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64